export default {
  // 应用类型
  app_type: {
    0: '公众号',
    1: '小程序'
  },
  // 注册方式
  register_type: {
    '-1': '未知',
    0: '普通方式注册',
    2: '通过复用公众号创建小程序api注册',
    6: '通过法人扫脸创建企业小程序api注册',
    13: '通过创建试用小程序api注册',
    15: '通过联盟控制台注册',
    16: '通过创建个人小程序api注册',
    17: '通过创建个人交易小程序api注册',
    19: '通过试用小程序转正api注册',
    22: '通过复用商户号创建企业小程序api注册',
    23: '通过复用商户号转正api注册'
  },
  // 账号状态
  account_status: {
    1: "正常",
    14: "已注销",
    16: "已封禁",
    18: "已告警",
    19: "已冻结"
  },
  // 是否
  true_or_false: {
    0: '否',
    1: '是'
  },
  // 是否 布尔型
  true_or_false_bool: {
    false: '否',
    true: '是'
  },
  // 认证类型
  verify_info: {
    '-1': '未认证',
    '0': '微信认证'
  },
  // 服务状态
  visit_status: {
    0: '已暂停服务',
    1: '正常'
  },
  // 审核状态
  audit_status: {
    0: '审核成功',
    1: '审核被拒绝',
    2: '审核中',
    3: '已撤回',
    4: '审核延后'
  },
  // UGC场景
  ugc_scene: {
    0: '不涉及用户生成内容',
    1: '用户资料',
    2: '图片',
    3: '视频',
    4: '文本',
    5: '音频',
  },
  // UGC内容安全机制
  ugc_method: {
    1: '使用平台建议的内容安全API',
    2: '使用其他的内容审核产品',
    3: '通过人工审核把关',
    4: '未做内容审核把关'
  }

}
